In [21]:
import pandas as pd

In [22]:
import numpy as np

In [23]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

In [24]:
df1.shape

(5, 3)

In [25]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [26]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [28]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [29]:
df1["A"]+=10

In [30]:
df1

    A   B    C
0  11  10  100
1  12  20  200
2  13  30  300
3  14  40  400
4  15  50  500

DATAFRAMES APPLYING FUNCTIONS

In [31]:
def square(x):
    return x*x

In [36]:
df1["D"] = df1["B"].apply(lambda x:x*x)

In [37]:
df1

    A     B    C        D
0  11   100  100    10000
1  12   400  200   160000
2  13   900  300   810000
3  14  1600  400  2560000
4  15  2500  500  6250000